# 1)კომენტარის მეშვეობით ახსენით .lower() / .upper() / .capitalize() / .find() ფუნქციების დანიშნულება

# .lower() - წინადადებას აპატარავებს
# .upper() - წინადადებას ადიდებს
# .capitalize() - წინადადების პირველ ასოს ადიდებს
# .find() - ეძებს კონკრეტულ სიმბოლოს

# 2)მომხმარებელს შემოატანინეთ მისი გვარი და შეამოწმეთ, თუ გვარის პირველი ასო არის დიდი ასო, მაშინ დაუბეჭდეთ 
# "Hello", თუ არ არის მაშინ დაუბეჭდეთ "Bye"

# 3)მომხმარებელს შემოატანინეთ სახელი, შემდეგ შემოატანინეთ ასო 
# და თუ ამ სახელში ეს ასო არიქნება, მაშინ გამოუტანეთ "Can't find character", თუ იქნება მაშინ გამოუტანეთ 
# "found it" და გვერდზე მიუწერეთ ამ ასოს ინდექსი

# 4)მომხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შეეკითხეთ როგორ უნდა რო შეიცვალოს მისი გვარის ასოები, თუ გიპასუხებთ
# "upper" გადაიყვანეთ მთლიანი გვარი დიდ ასოებად, თუ გიპასუხებთ "lower" გადაიყვანეთ 
# მთლიანი გვარი პატარა ასოებად და თუ გიპასუხებთ "capitalize" გადაიყვანეთ გვარის მხოლოდ პირველი ასო დიდ ასოდ.





surname = (input("შეიყვანეთ თქვენი გვარი: "))
if surname != surname.capitalize():
    print("bye")
if surname == surname.capitalize():
    print("hello")


    