# 1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემენტი

names = ["ilia","vano","giorgi","luka","data"]
names.pop(0)
print(names)
names = ["ilia","vano","giorgi","luka","data"]
names.pop(4)
print(names)

# 2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:

# .insert() - კონკრეტულ ელემენტზე ამატებს ელემენტს
# .append() - სიაში ვამატებთ ახალ ელემენტს
# .pop() - სიიდან ვშლით კონკრეტულ ელემენტს
# .len() - ვიგებთ სიის ელემენტის სიგრძეს


# 3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე

names = ["ilia","vano","giorgi","luka","data"]
names.insert(2,"nika")
print(names)




