# 0)უყურეთ ჩანაწერს თავიდან

# 1)მომხმარებელს შემოატანინეთ მისი სახელი და თუ ეს სახელი უდრის თქვენს სახელს, დაბეჭდეთ "Hello" სხვა შემთხვევაში "Bye".

nam = (input("შეიყვანეთ თქვენი სახელი: "))

if nam == "ilia":
    print("hello")

else:
    print("bye")



# 2)ცვლადში შეინახეთ თქვენი საყვარელი რიცხვი და მომხმარებელს შემოატანინეთ ასევე მისი საყვარელი რიცხვი, თუ თქვენი რიცხვები ემთხვევა მაშინ დაბეჭდეთ "Perfect" თუ მისი რიცხვი მეტია, დაბეჭდეთ "More", სხვა შემთხვევაში "Less".

nam1 = 25

nam = (int(input("შეიყვანეთ თქვენი საყვარელი რიცხვი: ")))

if nam == nam1:
    print("perfect")

elif nam > nam1:
    print("more")

else:
    print("less")



# 3)შექმენით for ციკლი 150ის დიაპაზონში და შეამოწმეთ თითოეული რიცხვი, თუ ეს რიცხვი არის ლუწი, მაშინ დაბეჭდეთ "Luwia" და გვერძე მიაწერეთ რიცხვი (მინიშნება ---> print("Luwia", i) ხოლო თუ იქნება კენტი, დაბეჭდეთ "Kentia" და გვერძე მიუწერეთ ეს რიცხვი.

# 4)მომხმარებელს შემოატანინეთ მისი ასაკი და ასევე მისი სახელი, თუ მომხმარებლის სახელი ემთხვევა თქვენს სახელს და ასევე მისი ასაკი ემთხვევა თქვენს სახელს, დაბეჭდეთ "Twins" სხვა შემთხვევაში "Not Twins".

age_and_name = input("შეიყვანეთ თქვენი ასაკი და თქვენი სახელი: ")

if age_and_name =="ilia13":
    print("twins")

else:
    print("not twins")



# 5)შექმენით ცვლადი სადაც შეინახავთ ორიგინალ აქაუნთის პაროლს, და while ციკლის მეშვეობით მომხმარებელს შეეკითხეთ აქაუნთის პაროლი იქამდე სანამ სწორედ არ გამოიცნობს.

password = "traqtori5"
nam = input("შეიყვანეთ პაროლი: ")
while nam != password:
    nam = input("შეიყვანეთ პაროლი: ")
print("great")
















