
# 1)შექმენით ცარიელი სია და for ციკლის მეშვეობით ჩაამატეთ ყველა ლუწი რიცხვი 0დან 200მდე, ბოლოს დაბეჭდეთ სია.
# arr = []

# for i in range(0,200,2):
#     arr.append(i)
#     print(i)


# 2)შექმენით ცარიელი სია და for ციკლის მეშვოებით მომხმარებელს შეეკითხეთ მისი top 5 საყვარელი სახელი (ანუ ხუთჯერ input).

# names = ["ilia","vano","giorgi","nika","demetre"]

# for i in range(5):
#     names.append(input("enter your favorite name:"))

# print(names)
# 3)შექმენით სია 10 ელემენტით და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტები.
# numbers = [0,1,2,3,4,5,6,7,8,9]

# for i in numbers:
#     if i % 2 == 1:
#         print(i)


# 4)შექმენით ცვლადი რომელშიც შენახული იქნება სტრინგი შემდეგ კი გაიგეთ ამ სტრინგის სიმბოლოების რაოდენობა.

# name = "ilia"
# print(len(name))





# 5)შექმენით სია შემდგარი 5 ელემენტისგან, მომხმარებელს შემოატანინეთ რიცხვი და სიიდან ამოაგდეთ შემოტანილ რიცხვის ინდექსზე მდგომი ელემენტი.
num = [1,2,3,4,5]
num.pop(input("enter number: "))
print(num)


# 6)შექმენით სია და დაბეჭდეთ ამ სიის სიგრძე.

# name = ["ilia","vano","giorgi"]
# print(len(name))

# 7)ვისაც არ დაგისრულებიათ საკლასო სამუშაო დაასრულეთ აუცილებლად.




