# concatenation - კონკატინაცია - ორი ან მეტი სტრინგის შეტყუპება





age = input("შეიყვანეთ თქვენი ასაკი")


num = 13 / 2
print(num)
print(type(num))

# 1)შემოიტანეთ თქვენი ოჯახის წევრების ასაკი და დაუპრინტეთ თუ რამდენი წლისები იქნებიან 25 წლის შემდეგ(გამოიყენეთ int ფუნქცია).
# 2)მომხმარებელს შემოატანინეთ მისი სახელი და type ფუნქციის საშუალებით გაიგეთ რა ტიპის მონაცემია შემოტანილი მნიშვნელობა.
# 3)მომხმარებელს შემოატანინეთ მისი ასაკი და შემდეგ გადააქციეთ სტრინგად
# 4)კომენტარებით ახსენით რას აკეთებს str(),int() და float() ფუნქციები.

