# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.
numbers = [1,2,3,4,5,6,7,8,9,10]
sum = 1

for i in numbers:
    sum *= i

print(sum)




# 2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.

numbers = [0,1,2,3,4,5,6,7,8,9]

print(numbers[:9])



# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.

numbers = [1,8,25,4,5]

for i in numbers:
    if i < 5:
        print(i)




# 4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.
numbers = [1,2,3,4,5,6,7,8,9,10]

sum = 0

for i in numbers:
    sum += i

print(sum)



# 5)კომენტარებით ახსენით რისი გაკეთება შეგვიძლია slicing ით.

# slicing - გამოიყენება სიიდან ან სტრინგიდან რამოდენიმე ელემენტის ამოსაღებად


















