# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით
# def sum(num1,num2):
#     return num1 + num2

# print(sum(5,5))


# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.
# .isalnum() - is alpha numeric - აბრუნებს True იმ შემთხვევაში თუ სტრინგში არის რიცხვი ან ასო (ან ორივე)
# .isdigit() - აბრუნებს True იმ შემთხვევაში უ სტრინგში არის მარტო რიცხვები სხვა შემთხვევაში False 
# .islower() - აბრუნებს True თუ სტრინგი შედგება მხოლოდ პატარა ასოებით
# .isnumeric()
# .isupper() - აბრუნებს True იმ შემთხვევაში თუ სტრინგი შედგება მხოლოდ დიდი ასოებით
# .count() - აბრუნებს რამდენჯერ მეორდება სიაში კონკრეტული სიმბოლო


# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები
# min() - აბრუნებს მინიმალურ მნიშვნელობას
# max() - აბრუნებს მაქსიმალურ მნიშვნელობას

# 4)გადახედეთ ჩანაწერს აუცილებლად თავიდან

